embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
#include <embedDIP_configs.h>

#ifdef TARGET_BOARD_STM32F7

#include "device/serial/serial.h"
#include "stm32f7xx_hal.h"
#include <stdio.h>
#include <stdarg.h>
#include "device/camera/camera.h"
#include "board/stm32f7/configs.h"

// Use the UART handle generated by STM32CubeMX
extern DCMI_HandleTypeDef hdcmi;
extern DMA2D_HandleTypeDef hdma2d;

#define CAMERA_I2C_ADDRESS ((uint16_t)0x78)
#define OV5640_ID 0x5640
/**
 * @brief  OV5640 Registers
 */

/**
 * @brief  OV5640 Features Parameters
 */

/* Brightness */
#define OV5640_BRIGHTNESS_LEVEL4P 0x00 /* Brightness level +4         */
#define OV5640_BRIGHTNESS_LEVEL3P 0x01 /* Brightness level +3         */
#define OV5640_BRIGHTNESS_LEVEL2P 0x02 /* Brightness level +2         */
#define OV5640_BRIGHTNESS_LEVEL1P 0x04 /* Brightness level +1         */
#define OV5640_BRIGHTNESS_LEVEL0 0x08  /* Brightness level 0          */
#define OV5640_BRIGHTNESS_LEVEL1N 0x10 /* Brightness level -1         */
#define OV5640_BRIGHTNESS_LEVEL2N 0x20 /* Brightness level -2         */
#define OV5640_BRIGHTNESS_LEVEL3N 0x40 /* Brightness level -3         */
#define OV5640_BRIGHTNESS_LEVEL4N 0x80 /* Brightness level -4         */

/* Saturation */
#define OV5640_SATURATION_LEVEL4P 0x00 /* Saturation level +4         */
#define OV5640_SATURATION_LEVEL3P 0x01 /* Saturation level +3         */
#define OV5640_SATURATION_LEVEL2P 0x02 /* Saturation level +2         */
#define OV5640_SATURATION_LEVEL1P 0x04 /* Saturation level +1         */
#define OV5640_SATURATION_LEVEL0 0x08  /* Saturation level 0          */
#define OV5640_SATURATION_LEVEL1N 0x10 /* Saturation level -1         */
#define OV5640_SATURATION_LEVEL2N 0x20 /* Saturation level -2         */
#define OV5640_SATURATION_LEVEL3N 0x40 /* Saturation level -3         */
#define OV5640_SATURATION_LEVEL4N 0x80 /* Saturation level -4         */

/* Contrast */
#define OV5640_CONTRAST_LEVEL4P 0x00 /* Contrast level +4           */
#define OV5640_CONTRAST_LEVEL3P 0x01 /* Contrast level +3           */
#define OV5640_CONTRAST_LEVEL2P 0x02 /* Contrast level +2           */
#define OV5640_CONTRAST_LEVEL1P 0x04 /* Contrast level +1           */
#define OV5640_CONTRAST_LEVEL0 0x08  /* Contrast level 0            */
#define OV5640_CONTRAST_LEVEL1N 0x10 /* Contrast level -1           */
#define OV5640_CONTRAST_LEVEL2N 0x20 /* Contrast level -2           */
#define OV5640_CONTRAST_LEVEL3N 0x40 /* Contrast level -3           */
#define OV5640_CONTRAST_LEVEL4N 0x80 /* Contrast level -4           */

/* Hue Control */
#define OV5640_HUE_150P 0x0001 /* Hue 150+ degree           */
#define OV5640_HUE_120P 0x0002 /* Hue 120+ degree           */
#define OV5640_HUE_90P 0x0004  /* Hue 90+ degree            */
#define OV5640_HUE_60P 0x0008  /* Hue 60+ degree            */
#define OV5640_HUE_30P 0x0010  /* Hue 30+ degree            */
#define OV5640_HUE_0 0x0020    /* Hue 0 degree              */
#define OV5640_HUE_30N 0x0040  /* Hue 30- degree            */
#define OV5640_HUE_60N 0x0080  /* Hue 60- degree            */
#define OV5640_HUE_90N 0x0100  /* Hue 90- degree            */
#define OV5640_HUE_120N 0x0200 /* Hue 120- degree           */
#define OV5640_HUE_150N 0x0400 /* Hue 150- degree           */
#define OV5640_HUE_180N 0x0800 /* Hue 180- degree           */

/* Mirror/Flip */
#define OV5640_MIRROR 0x00             /* Set camera mirror config    */
#define OV5640_FLIP 0x01               /* Set camera flip config      */
#define OV5640_MIRROR_FLIP 0x02        /* Set camera mirror and flip  */
#define OV5640_MIRROR_FLIP_NORMAL 0x04 /* Set camera normal mode      */

/* Zoom */
#define OV5640_ZOOM_x8 0x00
#define OV5640_ZOOM_x4 0x11
#define OV5640_ZOOM_x2 0x22
#define OV5640_ZOOM_x1 0x44

/* Special Effect */
#define OV5640_COLOR_EFFECT_NONE 0x00         /* No effect               */
#define OV5640_COLOR_EFFECT_BLUE 0x01         /* Blue effect             */
#define OV5640_COLOR_EFFECT_RED 0x02          /* Red effect              */
#define OV5640_COLOR_EFFECT_GREEN 0x04        /* Green effect            */
#define OV5640_COLOR_EFFECT_BW 0x08           /* Black and White effect  */
#define OV5640_COLOR_EFFECT_SEPIA 0x10        /* Sepia effect            */
#define OV5640_COLOR_EFFECT_NEGATIVE 0x20     /* Negative effect         */
#define OV5640_COLOR_EFFECT_BW_NEGATIVE 0x40  /* BW Negative effect      */
#define OV5640_COLOR_EFFECT_OVEREXPOSURE 0x80 /* Over exposure effect    */
#define OV5640_COLOR_EFFECT_SOLARIZE 0x100    /* Solarized effect       */

/* Light Mode */
#define OV5640_LIGHT_AUTO 0x00   /* Light Mode Auto             */
#define OV5640_LIGHT_SUNNY 0x01  /* Light Mode Sunny            */
#define OV5640_LIGHT_OFFICE 0x02 /* Light Mode Office           */
#define OV5640_LIGHT_HOME 0x04   /* Light Mode Home             */
#define OV5640_LIGHT_CLOUDY 0x08 /* Light Mode Claudy           */

/* Saturation */
#define OV5640_SATURATION_0 0x00 /* Color saturation 0          */
#define OV5640_SATURATION_1 0x01 /* Color saturation 1          */
#define OV5640_SATURATION_2 0x02 /* Color saturation 2          */
#define OV5640_SATURATION_3 0x04 /* Color saturation 3          */

/* Exposure */
#define OV5640_EXPOSURE_LEVEL_0 0x00 /* Exposure Level 0            */
#define OV5640_EXPOSURE_LEVEL_1 0x01 /* Exposure Level 1            */
#define OV5640_EXPOSURE_LEVEL_2 0x02 /* Exposure Level 2            */
#define OV5640_EXPOSURE_LEVEL_3 0x04 /* Exposure Level 3            */

static uint32_t ov5640_ConvertValue(uint32_t feature, uint32_t value);

/* OV5640 Light Mode setting */
const uint16_t OV5640_LightModeAuto[][2] =
    {
        {0x3406, 0x00},
        {0x3400, 0x04},
        {0x3401, 0x00},
        {0x3402, 0x04},
        {0x3403, 0x00},
        {0x3404, 0x04},
        {0x3405, 0x00},
};

const uint16_t OV5640_LightModeCloudy[][2] =
    {
        {0x3406, 0x01},
        {0x3400, 0x06},
        {0x3401, 0x48},
        {0x3402, 0x04},
        {0x3403, 0x00},
        {0x3404, 0x04},
        {0x3405, 0xd3},
};

const uint16_t OV5640_LightModeOffice[][2] =
    {
        {0x3406, 0x01},
        {0x3400, 0x05},
        {0x3401, 0x48},
        {0x3402, 0x04},
        {0x3403, 0x00},
        {0x3404, 0x07},
        {0x3405, 0xcf},
};

const uint16_t OV5640_LightModeHome[][2] =
    {
        {0x3406, 0x01},
        {0x3400, 0x04},
        {0x3401, 0x10},
        {0x3402, 0x04},
        {0x3403, 0x00},
        {0x3404, 0x08},
        {0x3405, 0xB6},
};

const uint16_t OV5640_LightModeSunny[][2] =
    {
        {0x3406, 0x01},
        {0x3400, 0x06},
        {0x3401, 0x1c},
        {0x3402, 0x04},
        {0x3403, 0x00},
        {0x3404, 0x04},
        {0x3405, 0xf3},
};

/**
 * @brief  Set the OV5640 camera Light Mode.
 * @param  DeviceAddr : Device address on communication Bus.
 * @param  Effect : Effect to be configured
 * @retval None
 */
void OV5640_SetLightMode(uint16_t DeviceAddr, uint8_t LightMode)
{
    uint32_t index = 0;

    CAMERA_IO_Write(DeviceAddr, 0x3406, 0x00);
    CAMERA_IO_Write(DeviceAddr, 0x5190, 0x46);
    CAMERA_IO_Write(DeviceAddr, 0x5191, 0xf8);
    CAMERA_IO_Write(DeviceAddr, 0x5192, 0x04);

    switch (LightMode)
    {
    case OV5640_LIGHT_AUTO:
        for (index = 0; index < (sizeof(OV5640_LightModeAuto) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeAuto[index][0], OV5640_LightModeAuto[index][1]);
        }
        break;
    case OV5640_LIGHT_SUNNY:
        for (index = 0; index < (sizeof(OV5640_LightModeSunny) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeSunny[index][0], OV5640_LightModeSunny[index][1]);
        }
        break;
    case OV5640_LIGHT_OFFICE:
        for (index = 0; index < (sizeof(OV5640_LightModeOffice) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeOffice[index][0], OV5640_LightModeOffice[index][1]);
        }
        break;
    case OV5640_LIGHT_CLOUDY:
        for (index = 0; index < (sizeof(OV5640_LightModeCloudy) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeCloudy[index][0], OV5640_LightModeCloudy[index][1]);
        }
        break;
    case OV5640_LIGHT_HOME:
        for (index = 0; index < (sizeof(OV5640_LightModeHome) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeHome[index][0], OV5640_LightModeHome[index][1]);
        }
        break;
    default:
        /* Auto light mode used */
        for (index = 0; index < (sizeof(OV5640_LightModeAuto) / 4); index++)
        {
            CAMERA_IO_Write(DeviceAddr, OV5640_LightModeAuto[index][0], OV5640_LightModeAuto[index][1]);
        }
        break;
    }
}

/**
 * @brief  Set the OV5640 camera Special Effect.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Effect: Effect to be configured
 * @retval None
 */
void OV5640_SetEffect(uint16_t DeviceAddr, uint32_t Effect)
{
    switch (Effect)
    {
    case OV5640_COLOR_EFFECT_NONE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0x7F);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x00);
        break;

