embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
    case OV5640_COLOR_EFFECT_BLUE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0xA0);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x40);
        break;

    case OV5640_COLOR_EFFECT_RED:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0xC0);
        break;

    case OV5640_COLOR_EFFECT_GREEN:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x60);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x60);
        break;

    case OV5640_COLOR_EFFECT_BW:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x80);
        break;

    case OV5640_COLOR_EFFECT_SEPIA:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0xA0);
        break;

    case OV5640_COLOR_EFFECT_NEGATIVE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x40);
        break;

    case OV5640_COLOR_EFFECT_BW_NEGATIVE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x58);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x40);
        break;

    case OV5640_COLOR_EFFECT_OVEREXPOSURE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0xF0);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0xF0);
        break;

    case OV5640_COLOR_EFFECT_SOLARIZE:
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x06);
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x10);
        CAMERA_IO_Write(DeviceAddr, 0x5003, 0x09);
        break;

    default:
        /* No effect */
        CAMERA_IO_Write(DeviceAddr, 0x5001, 0x7F);
        CAMERA_IO_Write(DeviceAddr, 0x5580, 0x00);
        break;
    }
}

/**
 * @brief  Set the OV5640 camera Brightness Level.
 * @note   The brightness of OV5640 could be adjusted. Higher brightness will
 *         make the picture more bright. The side effect of higher brightness
 *         is the picture looks foggy.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Level: Value to be configured
 * @retval None
 */
void OV5640_SetBrightness(uint16_t DeviceAddr, uint8_t Level)
{
    CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);

    switch (Level)
    {
    case OV5640_BRIGHTNESS_LEVEL4P:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x40);
        break;

    case OV5640_BRIGHTNESS_LEVEL3P:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x30);
        break;

    case OV5640_BRIGHTNESS_LEVEL2P:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x20);
        break;

    case OV5640_BRIGHTNESS_LEVEL1P:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x10);
        break;

    case OV5640_BRIGHTNESS_LEVEL0:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x00);
        break;

    case OV5640_BRIGHTNESS_LEVEL1N:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x10);
        break;

    case OV5640_BRIGHTNESS_LEVEL2N:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x20);
        break;

    case OV5640_BRIGHTNESS_LEVEL3N:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x30);
        break;

    case OV5640_BRIGHTNESS_LEVEL4N:
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x40);
        break;

    default:
        /* Level 0 as default */
        Level = OV5640_BRIGHTNESS_LEVEL0;
        CAMERA_IO_Write(DeviceAddr, 0x5587, 0x00);
        break;
    }

    CAMERA_IO_Write(DeviceAddr, 0x5580, 0x04);

    if (Level < OV5640_SATURATION_LEVEL1N)
    {
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x01);
    }
    else
    {
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x09);
    }
}

/**
 * @brief  Set the OV5640 camera Saturation Level.
 * @note   The color saturation of OV5640 could be adjusted. High color saturation
 *         would make the picture looks more vivid, but the side effect is the
 *         bigger noise and not accurate skin color.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Level: Value to be configured
 * @retval None
 */
void OV5640_SetSaturation(uint16_t DeviceAddr, uint8_t Level)
{
    CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);

    switch (Level)
    {
    case OV5640_SATURATION_LEVEL4P:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x40);
        break;

    case OV5640_SATURATION_LEVEL3P:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x50);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x50);
        break;

    case OV5640_SATURATION_LEVEL2P:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x60);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x60);
        break;

    case OV5640_SATURATION_LEVEL1P:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x70);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x70);
        break;

    case OV5640_SATURATION_LEVEL0:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x80);
        break;

    case OV5640_SATURATION_LEVEL1N:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x30);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x30);
        break;

    case OV5640_SATURATION_LEVEL2N:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x20);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x20);
        break;

    case OV5640_SATURATION_LEVEL3N:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x10);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x10);
        break;

