embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
    case OV5640_SATURATION_LEVEL4N:
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x00);
        break;

    default:
        /* Level 0 as default */
        CAMERA_IO_Write(DeviceAddr, 0x5583, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5584, 0x40);
        break;
    }

    CAMERA_IO_Write(DeviceAddr, 0x5580, 0x02);
    CAMERA_IO_Write(DeviceAddr, 0x5588, 0x41);
}

/**
 * @brief  Set the OV5640 camera Contrast Level.
 * @note   The contrast of OV5640 could be adjusted. Higher contrast will make
 *         the picture sharp. But the side effect is loosing dynamic range.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Level: Value to be configured
 * @retval None
 */
void OV5640_SetContrast(uint16_t DeviceAddr, uint8_t Level)
{
    CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
    CAMERA_IO_Write(DeviceAddr, 0x5580, 0x04);

    switch (Level)
    {
    case OV5640_CONTRAST_LEVEL4P:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x30);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x30);
        break;

    case OV5640_CONTRAST_LEVEL3P:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x2C);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x2C);
        break;

    case OV5640_CONTRAST_LEVEL2P:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x28);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x28);
        break;

    case OV5640_CONTRAST_LEVEL1P:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x24);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x24);
        break;

    case OV5640_CONTRAST_LEVEL0:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x20);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x20);
        break;

    case OV5640_CONTRAST_LEVEL1N:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x1C);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x1C);
        break;

    case OV5640_CONTRAST_LEVEL2N:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x18);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x18);
        break;

    case OV5640_CONTRAST_LEVEL3N:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x14);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x14);
        break;

    case OV5640_CONTRAST_LEVEL4N:
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x10);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x10);
        break;

    default:
        /* Level 0 as default */
        CAMERA_IO_Write(DeviceAddr, 0x5586, 0x20);
        CAMERA_IO_Write(DeviceAddr, 0x5585, 0x20);
        break;
    }

    CAMERA_IO_Write(DeviceAddr, 0x5588, 0x41);
}

/**
 * @brief  Set the OV5640 camera Contrast Level.
 * @note   The contrast of OV5640 could be adjusted. Higher contrast will make
 *         the picture sharp. But the side effect is loosing dynamic range.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Level: Value to be configured
 * @retval None
 */
void OV5640_SetPixelFormat(uint16_t DeviceAddr, uint8_t Level)
{
    (void)DeviceAddr;
    (void)Level;

    // TODO: Implement pixel format setting
}

/**
 * @brief  Set the OV5640 camera Hue degree.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Level: Value to be configured
 * @retval None
 */
void OV5640_SetHueDegree(uint16_t DeviceAddr, uint16_t Degree)
{
    CAMERA_IO_Write(DeviceAddr, 0x5001, 0xFF);
    CAMERA_IO_Write(DeviceAddr, 0x5580, 0x01);

    switch (Degree)
    {
    case OV5640_HUE_150P:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x31);
        break;

    case OV5640_HUE_120P:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x31);
        break;

    case OV5640_HUE_90P:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x31);
        break;

    case OV5640_HUE_60P:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x01);
        break;

    case OV5640_HUE_30P:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x01);
        break;

    case OV5640_HUE_0:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x01);
        break;

    case OV5640_HUE_30N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x02);
        break;

    case OV5640_HUE_60N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x02);
        break;

    case OV5640_HUE_90N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x02);
        break;

    case OV5640_HUE_120N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x32);
        break;

    case OV5640_HUE_150N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x6F);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x40);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x32);
        break;

    case OV5640_HUE_180N:
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x32);
        break;

    default:
        /* Hue degree 0 as default */
        CAMERA_IO_Write(DeviceAddr, 0x5581, 0x80);
        CAMERA_IO_Write(DeviceAddr, 0x5582, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5588, 0x01);
        break;
    }
}

/**
 * @brief  Control OV5640 camera mirror/vflip.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Config: To configure mirror, flip, both or nothing
 * @retval None
 */
void OV5640_MirrorFlipConfig(uint16_t DeviceAddr, uint8_t Config)
{
    uint8_t tmp3820 = 0, tmp3821;

    tmp3820 = CAMERA_IO_Read(DeviceAddr, 0x3820);
    tmp3820 &= 0xF9;
    tmp3821 = CAMERA_IO_Read(DeviceAddr, 0x3821);
    tmp3821 &= 0xF9;

