embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
    switch (Config)
    {
    case OV5640_MIRROR:
        CAMERA_IO_Write(DeviceAddr, 0x3820, tmp3820 | 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x3821, tmp3821 | 0x06);
        break;

    case OV5640_FLIP:
        CAMERA_IO_Write(DeviceAddr, 0x3820, tmp3820 | 0x06);
        CAMERA_IO_Write(DeviceAddr, 0x3821, tmp3821 | 0x00);
        break;
    case OV5640_MIRROR_FLIP:
        CAMERA_IO_Write(DeviceAddr, 0x3820, tmp3820 | 0x06);
        CAMERA_IO_Write(DeviceAddr, 0x3821, tmp3821 | 0x06);
        break;

    case OV5640_MIRROR_FLIP_NORMAL:
        CAMERA_IO_Write(DeviceAddr, 0x3820, tmp3820 | 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x3821, tmp3821 | 0x06);
        break;

    default:
        CAMERA_IO_Write(DeviceAddr, 0x3820, tmp3820 | 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x3821, tmp3821 | 0x00);
        break;
    }
}

/**
 * @brief  Get OV5640 camera resolution.
 * @param  DeviceAddr: Device address on communication Bus.
 * @retval Camera resolution else 0xFF
 */
int32_t OV5640_GetResolution(uint16_t DeviceAddr)
{
    uint16_t x_size = 0, y_size = 0;
    int32_t res = CAMERA_R640x480;

    x_size = CAMERA_IO_Read(DeviceAddr, 0x3808) << 8;
    x_size |= CAMERA_IO_Read(DeviceAddr, 0x3809);
    y_size = CAMERA_IO_Read(DeviceAddr, 0x380A) << 8;
    y_size |= CAMERA_IO_Read(DeviceAddr, 0x380B);

    if ((x_size == 640) && (y_size == 480))
    {
        res = CAMERA_R640x480;
    }
    else if ((x_size == 480) && (y_size == 272))
    {
        res = CAMERA_R480x272;
    }
    else if ((x_size == 320) && (y_size == 240))
    {
        res = CAMERA_R320x240;
    }
    else if ((x_size == 160) && (y_size == 120))
    {
        res = CAMERA_R160x120;
    }
    else
    {
        res = 0xFF;
    }
    return res;
}

/**
 * @brief  Control OV5640 camera mirror/vflip.
 * @param  DeviceAddr: Device address on communication Bus.
 * @param  Zoom: Zoom to be configured
 * @retval None
 */
void OV5640_ZoomConfig(uint16_t DeviceAddr, uint8_t Zoom)
{
    int32_t res = 0;

    /* Get camera resolution */
    res = OV5640_GetResolution(DeviceAddr);

    if (Zoom == OV5640_ZOOM_x1)
    {
        CAMERA_IO_Write(DeviceAddr, 0x5600, 0x10);
    }
    else
    {
        switch (res)
        {
        case CAMERA_R320x240:
        case CAMERA_R480x272:
            Zoom = Zoom >> 1;
            break;
        case CAMERA_R640x480:
            Zoom = Zoom >> 2;
            break;
        default:
            break;
        }

        CAMERA_IO_Write(DeviceAddr, 0x5600, 0x00);
        CAMERA_IO_Write(DeviceAddr, 0x5601, Zoom);
    }
}

/******************************************************************************
                            Static Functions
*******************************************************************************/
/**
 * @brief  Convert input values into ov5640 parameters.
 * @param  feature: Camera feature to be configured
 * @param  value: Value to be configured
 * @retval The converted value
 */
static uint32_t ov5640_ConvertValue(uint32_t feature, uint32_t value)
{
    uint32_t ret = 0;

    switch (feature)
    {
    case CAMERA_BLACK_WHITE:
    {
        switch (value)
        {
        case CAMERA_BLACK_WHITE_BW:
        {
            ret = OV5640_COLOR_EFFECT_BW;
            break;
        }
        case CAMERA_BLACK_WHITE_NEGATIVE:
        {
            ret = OV5640_COLOR_EFFECT_NEGATIVE;
            break;
        }
        case CAMERA_BLACK_WHITE_BW_NEGATIVE:
        {
            ret = OV5640_COLOR_EFFECT_BW_NEGATIVE;
            break;
        }
        case CAMERA_BLACK_WHITE_NORMAL:
        default:
        {
            ret = OV5640_COLOR_EFFECT_NONE;
            break;
        }
        }
        break;
    }
    case CAMERA_CONTRAST_BRIGHTNESS:
    {
        switch (value)
        {
        case CAMERA_BRIGHTNESS_LEVEL0:
        {
            ret = OV5640_BRIGHTNESS_LEVEL4N;
            break;
        }
        case CAMERA_BRIGHTNESS_LEVEL1:
        {
            ret = OV5640_BRIGHTNESS_LEVEL2N;
            break;
        }
        case CAMERA_BRIGHTNESS_LEVEL2:
        {
            ret = OV5640_BRIGHTNESS_LEVEL0;
            break;
        }
        case CAMERA_BRIGHTNESS_LEVEL3:
        {
            ret = OV5640_BRIGHTNESS_LEVEL2P;
            break;
        }
        case CAMERA_BRIGHTNESS_LEVEL4:
        {
            ret = OV5640_BRIGHTNESS_LEVEL4P;
            break;
        }
        case CAMERA_CONTRAST_LEVEL0:
        {
            ret = OV5640_CONTRAST_LEVEL4N;
            break;
        }
        case CAMERA_CONTRAST_LEVEL1:
        {
            ret = OV5640_CONTRAST_LEVEL2N;
            break;
        }
        case CAMERA_CONTRAST_LEVEL2:
        {
            ret = OV5640_CONTRAST_LEVEL0;
            break;
        }
        case CAMERA_CONTRAST_LEVEL3:
        {
            ret = OV5640_CONTRAST_LEVEL2P;
            break;
        }
        case CAMERA_CONTRAST_LEVEL4:
        {
            ret = OV5640_CONTRAST_LEVEL4P;
            break;
        }
        default:
        {
            ret = OV5640_CONTRAST_LEVEL0;
            break;
        }
        }
        break;
    }
    case CAMERA_COLOR_EFFECT:
    {
        switch (value)
        {
        case CAMERA_COLOR_EFFECT_ANTIQUE:
        {
            ret = OV5640_COLOR_EFFECT_SEPIA;
            break;
        }
        case CAMERA_COLOR_EFFECT_BLUE:
        {
            ret = OV5640_COLOR_EFFECT_BLUE;
            break;
        }
        case CAMERA_COLOR_EFFECT_GREEN:
        {
            ret = OV5640_COLOR_EFFECT_GREEN;
            break;
        }
        case CAMERA_COLOR_EFFECT_RED:
        {
            ret = OV5640_COLOR_EFFECT_RED;
            break;
        }
        case CAMERA_COLOR_EFFECT_NONE:
        default:
        {
            ret = OV5640_COLOR_EFFECT_NONE;
            break;
        }
        }
        break;
    default:
    {
        ret = 0;
        break;
    }
    }
    }

    return ret;
}

/**
 * @brief  Read the OV5640 Camera identity.
 * @param  DeviceAddr: Device address on communication Bus.
 * @retval the OV5640 ID
 */
uint16_t ov5640_ReadID(uint16_t DeviceAddr)
{
    uint16_t read_val = 0;

