embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
const uint16_t OV5640_QVGA[][2] =
    {
        {0x3808, 0x01},
        {0x3809, 0x40},
        {0x380a, 0x00},
        {0x380b, 0xF0},
        {0x4300, 0x6F},
        {0x4740, 0x22},
        {0x501f, 0x01},
};

/* Initialization sequence for QQVGA resolution (160x120) */
const uint16_t OV5640_QQVGA[][2] =
    {
        {0x3808, 0x00},
        {0x3809, 0xA0},
        {0x380a, 0x00},
        {0x380b, 0x78},
        //{0x4300, 0x10},// 0x6F for RGB
        //{0x4300, 0x23}, //rgb 888
        {0x4300, 0x6F}, // rgb 565
        {0x4740, 0x22},
        //{0x501f, 0x00},// 0x01 for RGB 0x00 for Grayscale
        {0x501f, 0x01}, // 0x01 for RGB
};

/* I2C clock speed configuration (in Hz)
   WARNING:
   Make sure that this define is not already declared in other files (ie.
   stm32746g_discovery.h file). It can be used in parallel by other modules. */
#ifndef I2C_SPEED
#define I2C_SPEED ((uint32_t)100000)
#endif /* I2C_SPEED */

typedef enum
{
    CAMERA_OK = 0x00,
    CAMERA_ERROR = 0x01,
    CAMERA_TIMEOUT = 0x02,
    CAMERA_NOT_DETECTED = 0x03,
    CAMERA_NOT_SUPPORTED = 0x04
} Camera_StatusTypeDef;

/* Camera module I2C HW address */
/* Image size */
uint32_t Im_size = 0;

HAL_StatusTypeDef hal_status = HAL_OK;

uint8_t CAMERA_Init(uint32_t Resolution) /*Camera initialization*/
{
    (void)Resolution;

    // TODO:

    return 0;
}

/**
 * @brief  CANERA power up
 * @retval None
 */
void CAMERA_PwrUp(void)
{
    GPIO_InitTypeDef gpio_init_structure;

    /* Enable GPIO clock */
    __HAL_RCC_GPIOH_CLK_ENABLE();

    /*** Configure the GPIO ***/
    /* Configure DCMI GPIO as alternate function */
    gpio_init_structure.Pin = GPIO_PIN_13;
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOH, &gpio_init_structure);

    /* De-assert the camera POWER_DOWN pin (active high) */
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_13, GPIO_PIN_RESET);

    HAL_Delay(3); /* POWER_DOWN de-asserted during 3ms */
}

/**
 * @brief  CAMERA power down
 * @retval None
 */
void CAMERA_PwrDown(void)
{
    GPIO_InitTypeDef gpio_init_structure;

    /* Enable GPIO clock */
    __HAL_RCC_GPIOH_CLK_ENABLE();

    /*** Configure the GPIO ***/
    /* Configure DCMI GPIO as alternate function */
    gpio_init_structure.Pin = GPIO_PIN_13;
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOH, &gpio_init_structure);

    /* Assert the camera POWER_DOWN pin (active high) */
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_13, GPIO_PIN_SET);
}

/*
static void test_ConvertLineRGB565ToARGB8888()
{
    // white/magenta test color pattern
    uint32_t offset_cam = 0;
    uint32_t offset_lcd = 0;

    for (uint32_t pos = 0; pos < LcdResX * LcdResY / 2; pos++)
    {
        uint32_t val = LCD_RGB565_COLOR_WHITE << 16 | LCD_RGB565_COLOR_DARKMAGENTA;
        *(__IO uint32_t *)(4 * pos + CAMERA_FRAME_BUFFER) = val;
    }

    for (uint32_t camera_line_nb = 0; camera_line_nb < CameraResY; camera_line_nb++)
    {
        LCD_LL_ConvertLineToARGB8888((uint32_t *)(CAMERA_FRAME_BUFFER + offset_cam),
                                     (uint32_t *)(LCD_FRAME_BUFFER + offset_lcd));

        offset_cam = offset_cam + (CameraResX * sizeof(uint16_t));
        offset_lcd = offset_lcd + (LcdResX * sizeof(uint32_t));
    }
}
*/

static void camera_init(ImageResolution resolution)
{

#define IMAGE_RES_QQVGA 0
#define IMAGE_RES_QVGA 1
#define IMAGE_RES_WQVGA 2
#define IMAGE_RES_VGA 3

    CAMERA_PwrDown();

    CAMERA_PwrUp();
    HAL_Delay(1000);

    // uint8_t status = CAMERA_ERROR;
    /* Read ID of Camera module via I2C */
    if (ov5640_ReadID(CAMERA_I2C_ADDRESS) == OV5640_ID)
    {
        /* Initialize the camera driver structure */
        uint32_t index = 0;

        for (index = 0; index < (sizeof(OV5640_Init) / 4); index++)
        {
            CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_Init[index][0], OV5640_Init[index][1]);
        }

        /* Initialize OV5640 */
        switch (resolution)
        {
        case CAMERA_R160x120:
        {
            for (index = 0; index < (sizeof(OV5640_QQVGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_QQVGA[index][0], OV5640_QQVGA[index][1]);
            }
            break;
        }
        case CAMERA_R320x240:
        {
            for (index = 0; index < (sizeof(OV5640_QVGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_QVGA[index][0], OV5640_QVGA[index][1]);
            }

            break;
        }
        case CAMERA_R480x272:
        {
            for (index = 0; index < (sizeof(OV5640_480x272) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_480x272[index][0], OV5640_480x272[index][1]);
            }
            break;
        }
        case CAMERA_R640x480:
        {
            for (index = 0; index < (sizeof(OV5640_VGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_VGA[index][0], OV5640_VGA[index][1]);
            }
            break;
        }
        default:
        {
            break;
        }
        }

        HAL_DCMI_DisableCROP(&hdcmi);
        HAL_Delay(500);

        // status = CAMERA_OK; /* Return CAMERA_OK status */
    }
    else
    {
        // status = CAMERA_NOT_SUPPORTED; /* Return CAMERA_NOT_SUPPORTED status */
    }

    HAL_Delay(1000); // Delay for the camera to output correct data
    __HAL_DCMI_DISABLE_IT(&hdcmi, DCMI_IT_LINE | DCMI_IT_VSYNC);
}

static void camera_capture(captureMode mode, Image *inImg)
{

    CAMERA_PwrDown();
    CAMERA_PwrUp();

    switch (inImg->format)
    {
    case IMAGE_FORMAT_GRAYSCALE:
        break;
    case IMAGE_FORMAT_RGB565:
        break;
    default:
        break;
    }

    // TODO

    HAL_DCMI_Start_DMA(&hdcmi, mode == CONTINUOUS ? DCMI_MODE_CONTINUOUS : DCMI_MODE_SNAPSHOT, (uint32_t)inImg->pixels, inImg->size / 2);
}

static void camera_stop(void)
{
    HAL_DCMI_Stop(&hdcmi);
}

static void camera_setRes(ImageResolution resolution)
{

