embeddip/examples-stm32/real working ov5640/stm32_ov5640.c
    CAMERA_PwrDown();
    CAMERA_PwrUp();

    // uint8_t status = CAMERA_ERROR;
    /* Read ID of Camera module via I2C */
    if (ov5640_ReadID(CAMERA_I2C_ADDRESS) == OV5640_ID)
    {
        /* Initialize the camera driver structure */
        uint32_t index = 0;

        for (index = 0; index < (sizeof(OV5640_Init) / 4); index++)
        {
            CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_Init[index][0], OV5640_Init[index][1]);
        }

        /* Initialize OV5640 */
        switch (resolution)
        {
        case CAMERA_R160x120:
        {
            for (index = 0; index < (sizeof(OV5640_QQVGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_QQVGA[index][0], OV5640_QQVGA[index][1]);
            }
            break;
        }
        case CAMERA_R320x240:
        {
            for (index = 0; index < (sizeof(OV5640_QVGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_QVGA[index][0], OV5640_QVGA[index][1]);
            }

            break;
        }
        case CAMERA_R480x272:
        {
            for (index = 0; index < (sizeof(OV5640_480x272) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_480x272[index][0], OV5640_480x272[index][1]);
            }
            break;
        }
        case CAMERA_R640x480:
        {
            for (index = 0; index < (sizeof(OV5640_VGA) / 4); index++)
            {
                CAMERA_IO_Write(CAMERA_I2C_ADDRESS, OV5640_VGA[index][0], OV5640_VGA[index][1]);
            }
            break;
        }
        default:
        {
            break;
        }
        }

        HAL_DCMI_DisableCROP(&hdcmi);
        HAL_Delay(500);

        // status = CAMERA_OK; /* Return CAMERA_OK status */
    }
    else
    {
        // status = CAMERA_NOT_SUPPORTED; /* Return CAMERA_NOT_SUPPORTED status */
    }

    HAL_Delay(1000); // Delay for the camera to output correct data
    __HAL_DCMI_DISABLE_IT(&hdcmi, DCMI_IT_LINE | DCMI_IT_VSYNC);
}

camera_t stm32_ov5640 = {
    .init = camera_init,
    .capture = camera_capture,
    .stop = camera_stop,
    .setRes = camera_setRes};
    
#endif
